/*
Для работы с протоколом ЕГТС используется адрес: 194.58.79.4.1:27199
*/

#include "egts.h"



//-----------------------------------------------------------------------------------------------------------

static int SEND_FLAGS = MSG_DONTWAIT | MSG_NOSIGNAL;

static const uint8_t eCRC8Table[256] = {
    0x00, 0x31, 0x62, 0x53, 0xC4, 0xF5, 0xA6, 0x97,
    0xB9, 0x88, 0xDB, 0xEA, 0x7D, 0x4C, 0x1F, 0x2E,
    0x43, 0x72, 0x21, 0x10, 0x87, 0xB6, 0xE5, 0xD4,
    0xFA, 0xCB, 0x98, 0xA9, 0x3E, 0x0F, 0x5C, 0x6D,
    0x86, 0xB7, 0xE4, 0xD5, 0x42, 0x73, 0x20, 0x11,
    0x3F, 0x0E, 0x5D, 0x6C, 0xFB, 0xCA, 0x99, 0xA8,
    0xC5, 0xF4, 0xA7, 0x96, 0x01, 0x30, 0x63, 0x52,
    0x7C, 0x4D, 0x1E, 0x2F, 0xB8, 0x89, 0xDA, 0xEB,
    0x3D, 0x0C, 0x5F, 0x6E, 0xF9, 0xC8, 0x9B, 0xAA,
    0x84, 0xB5, 0xE6, 0xD7, 0x40, 0x71, 0x22, 0x13,
    0x7E, 0x4F, 0x1C, 0x2D, 0xBA, 0x8B, 0xD8, 0xE9,
    0xC7, 0xF6, 0xA5, 0x94, 0x03, 0x32, 0x61, 0x50,
    0xBB, 0x8A, 0xD9, 0xE8, 0x7F, 0x4E, 0x1D, 0x2C,
    0x02, 0x33, 0x60, 0x51, 0xC6, 0xF7, 0xA4, 0x95,
    0xF8, 0xC9, 0x9A, 0xAB, 0x3C, 0x0D, 0x5E, 0x6F,
    0x41, 0x70, 0x23, 0x12, 0x85, 0xB4, 0xE7, 0xD6,
    0x7A, 0x4B, 0x18, 0x29, 0xBE, 0x8F, 0xDC, 0xED,
    0xC3, 0xF2, 0xA1, 0x90, 0x07, 0x36, 0x65, 0x54,
    0x39, 0x08, 0x5B, 0x6A, 0xFD, 0xCC, 0x9F, 0xAE,
    0x80, 0xB1, 0xE2, 0xD3, 0x44, 0x75, 0x26, 0x17,
    0xFC, 0xCD, 0x9E, 0xAF, 0x38, 0x09, 0x5A, 0x6B,
    0x45, 0x74, 0x27, 0x16, 0x81, 0xB0, 0xE3, 0xD2,
    0xBF, 0x8E, 0xDD, 0xEC, 0x7B, 0x4A, 0x19, 0x28,

    else if (tip & 2) return "Дизел";
    else if (tip & 4) return "Сжиженный природный газ (CNG)";
    else if (tip & 8) return "Жидкий пропан (LPG)";
    else if (tip & 0x10) return "Электро. (более 42B и 100 А/ч)";
    else if (tip & 0x20) return "Водород";

    return "PowerType unknown";

}
//-----------------------------------------------------------------------
static const char *ServName(uint8_t stp)
{
    switch (stp) {
        case EGTS_AUTH_SERVICE://         (1)
            return "EGTS_AUTH_SERVICE";
        case EGTS_TELEDATA_SERVICE://     (2)
            return "EGTS_TELEDATA_SERVICE";
        case EGTS_COMMANDS_SERVICE://     (4)
            return "EGTS_COMMANDS_SERVICE";
        case EGTS_FIRMWARE_SERVICE://     (9)
            return "EGTS_FIRMWARE_SERVICE";
        case EGTS_ECALL_SERVICE://        (10)
            return "EGTS_ECALL_SERVICE";
    }

    return "EGTS_UNKNOWN_SERVICE";
}
//-----------------------------------------------------------------------
static const char *SRVRPName(uint8_t prio)//Service Routing Priority
{
    switch (prio & 3) {
        case 0:
            return "TopPriority";
        case 1:
            return "HighPriority";
        case 2:
            return "MidlePriority";
        case 3:
            return "LowPriority";
    }

    return "UnknownPriority";
}
//-----------------------------------------------------------------------
static const char *SSTName(uint8_t stat)
{
    switch (stat) {
        case EGTS_SST_IN_SERVICE://0, //сервис в рабочем состоянии и разрешен к использованию
            return "EGTS_SST_IN_SERVICE";
        case EGTS_SST_OUT_OF_SERVICE://128, //сервис в нерабочем состоянии (выключен)
            return "EGTS_SST_OUT_OF_SERVICE";
        case EGTS_SST_DENIED://129//сервис запрещен для использования
            return "EGTS_SST_DENIED";
        case EGTS_SST_NO_CONF://130//сервис не настроен
            return "EGTS_SST_NO_CONF";
        case EGTS_SST_TEMP_UNAVAIL://131//сервис временно недоступен
            return "EGTS_SST_TEMP_UNAVAIL";
    }

    return "EGTS_SST_UNKNOWN";
}
//----------------------------------------------------------------------
static const char *SubRecName(uint8_t srt)
{
    switch (srt) {
        case EGTS_SR_RECORD_RESPONSE:
            return "EGTS_SR_RECORD_RESPONSE";//(0)
        case EGTS_SR_TERM_IDENTITY:
            return "EGTS_SR_TERM_IDENTITY";//(1)
        case EGTS_SR_MODULE_DATA:
            return "EGTS_SR_MODULE_DATA";//(2)
        case EGTS_SR_VEHICLE_DATA:
            return "EGTS_SR_VEHICLE_DATA";//(3)

        case EGTS_SR_DISPATCHER_IDENTITY:
            return "EGTS_SR_DISPATCHER_IDENTITY";//5
        case EGTS_SR_AUTH_PARAMS:
            return "EGTS_SR_AUTH_PARAMS";//(6)
        case EGTS_SR_AUTH_INFO:
            return "EGTS_SR_AUTH_INFO";//(7)
        case EGTS_SR_SERVICE_INFO:
            return "EGTS_SR_SERVICE_INFO";//(8)
        case EGTS_SR_RESULT_CODE:
            return "EGTS_SR_RESULT_CODE";//(9)
        case EGTS_SR_POS_DATA:

            return "EGTS_SR_POS_DATA";//16
        case EGTS_SR_EXT_POS_DATA:
            return "EGTS_SR_EXT_POS_DATA";//17
        case EGTS_SR_AD_SENSORS_DATA:
            return "EGTS_SR_AD_SENSORS_DATA";//18
        case EGTS_SR_COUNTERS_DATA:
            return "EGTS_SR_COUNTERS_DATA";//19
        case EGTS_SR_ACCEL_DATA:
            return "EGTS_SR_ACCEL_DATA";//20
        case EGTS_SR_STATE_DATA:
            return "EGTS_SR_STATE_DATA";//21
        case EGTS_SR_LOOPIN_DATA:
            return "EGTS_SR_LOOPIN_DATA";//22
        case EGTS_SR_ABS_DIG_SENS_DATA:
            return "EGTS_SR_ABS_DIG_SENS_DATA";//23
        case EGTS_SR_ABS_AN_SENS_DATA:
            return "EGTS_SR_ABS_AN_SENS_DATA";//24
        case EGTS_SR_ABS_CNTR_DATA:
            return "EGTS_SR_ABS_CNTR_DATA";//25
        case EGTS_SR_ABS_LOOPIN_DATA:
            return "EGTS_SR_ABS_LOOPIN_DATA";//26
        case EGTS_SR_LIQUID_LEVEL_SENSOR:
            return "EGTS_SR_LIQUID_LEVEL_SENSOR";//27
        case EGTS_SR_PASSENGERS_COUNTERS:
            return "EGTS_SR_PASSENGERS_COUNTERS";//28
    }

    return "EGTS_SR_UNKNOWN";
}
//---------------------------------------------------------------------------------------------------
static char *EpochToStr(uint32_t epoch, char *ts)
{
    if (ts) {
        const time_t ep = (time_t)epoch;
        struct tm *ct = localtime(&ep);
        sprintf(ts, "%02d:%02d:%02d %02d.%02d.%04d",
                    ct->tm_hour, ct->tm_min, ct->tm_sec,
                    ct->tm_mday, ct->tm_mon + 1, ct->tm_year + 1900);
    }

    return ts;
}
//---------------------------------------------------------------------------------------------------
void disconnectEGTS(int *esoc, uint8_t pr)
{
int s = *esoc;
sens_data_t msg = {0};

    if (s > 0) {
        shutdown(s, SHUT_RDWR);
        close(s);
        *esoc = -1;
        //
        egts_connect = false;
        //delQuePrnEgts();
        //if (!mk_quesens_egts) return 0;

        while (msgGetEgts(&msg) > 0) {
